artillery.yml
config:
  target: "http://localhost:3002"
  processor: "./gen_rand_ids.js"
  phases:
    - duration: 90
      arrivalRate: 200
      rampTo: 1000
  defaults:
    headers:
      x-my-service-auth: "987401838271002188298567"
scenarios:
  - flow:
    - function: "generateRandomData"
    - get:
        url: "/api/restaurants/{{ id }}/gallery"
    # - log: "Sent a request with {{ id }}"